
"""为什么需要字典"""

"""
    电话簿中存储了姓名和电话号码：
张三 ---> 13333333333
李四 ---> 14444444444
王五 ---> 15555555555
赵六 ---> 16666666666
"""
# 姓名
names = ['张三', '李四', '王五', '赵六']
# 电话号码
numbers = ['13333333333', '14444444444', '15555555555', '16666666666']
"""
    如果想要查找某人的电话号码
"""
print(numbers[names.index('王五')])  # 15555555555
"""
    最好能这样：把姓名和电话号码全部都存储在一个叫phonebook的数据结构中，指定姓名'王五'后就能
直接得到其对应的电话号码。
>>> phonebook['王五']
'15555555555'

    使用字典就可以实现。
"""
phonebook = {'张三': '13333333333',
             '李四': '14444444444',
             '王五': '15555555555',
             '赵六': '16666666666'}
print(phonebook['王五'])  # 15555555555
