
"""集合的创建"""

"""
    创建集合的常见方式有两种：
一、使用花括号
"""
s = {3, 5, 9, 2, 6}
print(s)  # {3, 5, 9, 2, 6}
"""
    集合中重复的元素会被去除掉。
"""
s = {3, 5, 3, 9, 2, 9, 3, 6}
print(s)  # {3, 5, 9, 2, 6}
"""
    不能使用{}表示空集合，因为{}表示空字典。
"""
print(type({})) # <class 'dict'>

"""
二、调用内置函数set（类set的构造方法）
"""
print(set(range(1, 6)))     # {1, 2, 3, 4, 5}
print(set([3, 5, 9, 2, 6])) # {3, 5, 9, 2, 6}
print(set((3, 5, 9, 2, 6))) # {3, 5, 9, 2, 6}
print(set('35926'))         # {'3', '5', '9', '2', '6'}
print(set({3, 5, 9, 2, 6})) # {3, 5, 9, 2, 6}

# 空集合
print(set())    # set()

"""
    集合中重复的元素会被去除掉。
"""
print(set([3, 5, 3, 9, 2, 9, 3, 6])) # {3, 5, 9, 2, 6}
